#+AUTHOR: OhKay.
#+TITLE: Opts.js
#+DATE: 2019-08-02
#+URL: /opts
#+ALIASES[]: /opts.html
#+DESCRIPTION: Command line optons and arguments parser for NodeJS
#+LASTMOD: 2020-08-14
#+TAGS[]: javascript opts command-line nodejs tools npm
#+TOC: true


#+BEGIN_QUOTE
You can find the source code and all examples at Github, [[https://github.com/khtdr/opts][github.com/khtdr/opts]].
#+END_QUOTE


** Quick-Start example
:PROPERTIES:
:CUSTOM_ID: example-1
:END:

The following example set up a custom "version" function, and opts in to the automatic help message. No pun intended.

[[https://raw.githubusercontent.com/khtdr/opts/master/examples/example1.js][opts/examples/example1.js]]
#+BEGIN_SRC javascript
var opts = require('opts');

var options = [
  { short       : 'v'
  , long        : 'version'
  , description : 'Show version and exit'
  , callback    : function () { console.log('v1.0'); process.exit(1); }
  }
];

opts.parse(options, true);
console.log('Example 1');
process.exit(0);
#+END_SRC


#+BEGIN_SRC bash
node ./example1
#+END_SRC

#+RESULTS:
: Example 1


#+BEGIN_SRC bash
node ./example1 --help
#+END_SRC

#+RESULTS:
: Usage: node ./example1 [options]
: Show this help message
:    --help
: Show version and exit
:    -v, --version

#+BEGIN_SRC sh
node ./example1 -v
#+END_SRC

#+RESULTS:
: v1.0


#+BEGIN_CENTER
See [[#more-examples][more examples]] below.
#+END_CENTER



